# Duct Fitting And Accessory Data Density Property

Source: https://www.revitapidocs.com/2026/39bfde86-cd51-d76c-49c5-2eda2ff7a2aa.htm

---

| Duct Fitting And Accessory Data Density Property |
| --- |

The air density for the duct fitting or duct accessory, Units: kg/ft^3\.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double Density { get; }
```

```
Public ReadOnly Property Density As Double
	Get
```

```
public:
property double Density {
	double get ();
}
```

```
member Density : float with get
```

#### Property Value

Double See Also

#### Reference

DuctFittingAndAccessoryData Class Autodesk.Revit.DB.Mechanical Namespace